
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ПустаяСтрока(ПараметрЗапуска) Тогда
		ОбработатьПараметрыЗапуска(ПараметрЗапуска);
	КонецЕсли;
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПараметрыЗапуска(ПутьКФайлу)
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Если Файл.Существует() И Файл.Расширение = ".mxl" Тогда
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.Прочитать(Файл.ПолноеИмя);
		ИмяРазложенногоФайла = Лев(Файл.ПолноеИмя, СтрДлина(Файл.ПолноеИмя) - 4) + "_mxl.txt";
		ТабДокумент.Записать(ИмяРазложенногоФайла, ТипФайлаТабличногоДокумента.TXT);
	КонецЕсли;
	
КонецПроцедуры